blog-posts/2003-09-12-mimerdesk-press-release.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MimerDesk press release</title>
<!-- 2015-10-19 Mon 14:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">MimerDesk press release</h1>
<p>
September 12th, 2003 -
<a href="http://sachachua.com/blog/p/1103"><a href="http://sachachua.com/blog/p/1103">http://sachachua.com/blog/p/1103</a></a>
</p>

<blockquote>
<p>
Espoo, Finland &#x2014; September 11, 2003 &#x2014; The new stable release of
MimerDesk
 introduces Type sets for the freedom of choice in pedagogical
methodologies,
 a better structured and more intuitive user interface and new tools
to
 further enhance effective collaboration.
</p>

<p>
MimerDesk takes one step closer towards pedagogical independence in
the sense
 that it is not limited to specific learning process methodologies,
but instead
 provides the possibility for the user to create Type sets for
different types
 of learning processes like Problem Based Learning.
</p>

<p>
The Project Manager in MimerDesk 2.0 is specifically designed to
provide more
 efficient manner of carrying out projects asynchronously. This tool
is ideal
 for group assignments and projects because of its illustrative
nature.
 The Project Manager includes a dynamic tree structure with unlimited
levels of
 tasks, participant specific task lists, task dependencies, milestones
and
 enhanced GANTT charts.
</p>

<p>
MimerDesk 2.0 also delivers an enhancement to the Calendar in the form
of a
 new tool, the Meeting Planner. The main objective of this tool is to
ease the
 process of arranging meetings with three or more people, be it for a
school
 project or a board meeting. The Meeting Planner is integrated with
the
 Calendar so that all meetings that are agreed upon are directly sent
to the
 participants' Calendars.
</p>

<p>
MimerDesk 2.0 introduces a more intuitive and easy-to-use structure in
 the form of top-level tabs that separate Personal, Groups and
Administration
 tools to form their own wholes. An individual user and group
administrators
 can dynamically select the desired set of tools to work with and this
freedom
 makes the environment more flexible and suitable for different types
of
 communities, groups and individuals.
</p>

<p>
As is to be expected, the MimerDesk 2.0 release fixes numerous bugs
and
 inconsistencies found in previous versions.
</p>

<p>
MimerDesk is a Free/Open Source web-based collaborative learning and
groupwork
 environment software. MimerDesk is published under the GNU GPL
license
</p>

<p>
(<a href="http://www.gnu.org/copyleft/gpl.html"><a href="http://www.gnu.org/copyleft/gpl.html">http://www.gnu.org/copyleft/gpl.html</a></a>).
The license protects the user's rights
 to use, change and distribute the MimerDesk software. The MimerDesk
software
 can be downloaded from the project website
(<a href="http://www.mimerdesk.org"><a href="http://www.mimerdesk.org">http://www.mimerdesk.org</a></a>).
</p>

<p>
Ionstream Oy is the main developer of the MimerDesk environment and
has a
 long history of expertise in Internet communities, teaching and
web-based
 collaborative learning. Ionstream Oy is focused on designing,
implementing
 and delivering customer-specific collaborative learning and groupware
 solutions.
</p>
</blockquote>

<p>
Argh. ;)
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
